pages/research/former.org
* Graduated PhD and EngD students

  - [[https://peterstandrews.github.io/][Dr Peter Mann]] (now my colleague at St Andrews): various
    applications of generating functions in network science
  - [[https://www.linkedin.com/in/darenasc/][Dr Diego Arenas Conteras]] (now at DFKI, the German Research Centre
    for Artificial Intelligence): data analytics, its automation and
    deployment
  - [[https://www.kcl.ac.uk/people/michael-pitcher][Dr Michael Pitcher]] (now at King’s College London): /in silico/
    modelling of tuberculosis (joint with St Andrews’ School of
    Medicine)
  - [[https://www.linkedin.com/in/cssec/][Dr Chris Schneider]] (now at Google): using unsupervised machine
    learning for fault identification in virtual machines
  - [[https://www.st-andrews.ac.uk/computer-science/people/lf28][Dr Lei Fang]] (now my colleague at St Andrews): sensor correlation,
    error detection, and inference, using statistical methods
  - [[https://www.linkedin.com/in/graeme-stevenson-683463117/][Dr Graeme Stevenson]]: programming with ontologically-structured
    data
  - [[https://www.wesleyan.edu/academics/faculty/sshai/profile.html][Dr Saray Shai]] (now at Wesleyan University): coupled adaptive
    complex networks
  - Dr Graham Williamson: Epidemic data dissemination in wireless
    sensor networks
  - Dr Hui Zhang (now at Amazon): coverage problems in dense
    homological and sparse mobile sensor networks
  - [[https://susanmckeever.blogspot.com/][Dr Susan McKeever]] (now at Technological University Dublin):
    situation recognition using Dempster-Shafer evidence theory
  - Dr Emerson Loureiro: dynamic autonomic management of CPU shares
  - [[http://www.comp.dit.ie/mcollins/][Dr Michael Collins]] (now at Technological University Dublin):
    secure wireless sensor network architectures
  - Dr Stephen Knox: situation recognition via case-based reasoning
  - [[http://www.adrianclear.com/][Dr Adrian K. Clear]] (now at NUI Galway): interactive definition
    and visualisation of situations
  - [[http://sites.google.com/site/juanyeresearch/][Dr Juan Ye]] (now my colleague at the University of St Andrews):
    situation recognition in pervasive and sensor-driven systems
  - [[https://research.tees.ac.uk/en/persons/mohammad-abdur-razzaque][Dr M.A. Razzaque]] (now at Teeside University): cross-layer
    autonomic communications architectures
  - Dr Tim Walsh: lightweight mobile agents
  - [[http://personal.cis.strath.ac.uk/%7Eterzis/][Dr Sotirios Terzis]] (now at the University of Strathclyde):
    pervasive trader architectures

* Postdocs

  - [[https://www.linkedin.com/in/davidecellai/][Dr Davide Cellai]] (now at the Central Bank of Ireland): network
    science
  - [[http://lorcancoyle.org/][Dr Lorcan Coyle]] (now at Intercomm): pervasive systems and machine
    learning
  - [[https://www.lancaster.ac.uk/scc/about-us/people/barry-porter][Prof Barry Porter]] (now at Lancaster University): languages for
    adaptive systems
