research/former/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<title>Former research students and postdocs | Simon Dobson</title>
<link rel="icon" href="../../images/favicon.png" sizes="16x16">
<link rel="alternate" type="application/rss+xml" href="../../rss.xml">
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Droid+Sans+Mono%7CLibre+Baskerville%7CMontserrat%7CPlayfair+Display%7CTangerine">
<link rel="stylesheet" href="../../assets/css/libretto_styles.css">
<link rel="stylesheet" href="../../assets/css/baguetteBox.min.css">
<link rel="stylesheet" href="../../assets/css/code.css">
<link rel="stylesheet" href="../../assets/css/nikola_rst.css">
<link rel="stylesheet" href="../../assets/css/nikola_ipython.css">
<link rel="stylesheet" href="https://use.fontawesome.com/releases/v5.0.13/css/all.css" integrity="sha384-DNOHZ68U8hZfKXOrtjWvjxusGo9WQnrNx2sqG0tfsghAvtVlRW3tvkXWZh58N9jp" crossorigin="anonymous">
</head>
<body>
    <!-- Navigation bar -->
    <header class="nav-bar"><div class="site-branding">
	    <h1 class="site-title">
		<a href="https://simondobson.org/" title="Simon Dobson" rel="home">Simon Dobson</a>
	    </h1>
	</div>
	<nav class="site-navigation" role="navigation"><div class="menu-toggle">
		<span class="mobile-site-title">Simon Dobson</span>
	    </div>
	    <ul class="menu">
<li><a href="../../index.html">Home</a></li>
		    <li><a href="../../personal/">About me</a></li>
		    <li><a href="../">Research</a></li>
		    <li><a href="../../development/projects/">Software</a></li>
		    <li><a href="../../writing/">Writing</a></li>
		    <li><a href="../../personal/contact/">Contact</a></li>
		<li>
<a href="../../rss.xml"><i class="fa fa-rss"></i></a>
	    </li>
</ul></nav></header><!-- Page Header --><div class="title-block post-format-icon-pin">
	<h1>Former research students and postdocs</h1>
    </div>

	<!-- Page Content -->
    <div class="site-content" role="main">
	<article class="format-standard libretto-long-form"><div class="entry-content">
		<div id="outline-container-orgbee5ce6" class="outline-2">
<h2 id="orgbee5ce6">Graduated PhD and EngD students</h2>
<div class="outline-text-2" id="text-orgbee5ce6">
<ul class="org-ul">
<li>
<a href="https://peterstandrews.github.io/">Dr Peter Mann</a> (now my colleague at St Andrews): various
applications of generating functions in network science</li>
<li>
<a href="https://www.linkedin.com/in/darenasc/">Dr Diego Arenas Conteras</a> (now at DFKI, the German Research Centre
for Artificial Intelligence): data analytics, its automation and
deployment</li>
<li>
<a href="https://www.kcl.ac.uk/people/michael-pitcher">Dr Michael Pitcher</a> (now at King’s College London): <i>in silico</i>
modelling of tuberculosis (joint with St Andrews’ School of
Medicine)</li>
<li>
<a href="https://www.linkedin.com/in/cssec/">Dr Chris Schneider</a> (now at Google): using unsupervised machine
learning for fault identification in virtual machines</li>
<li>
<a href="https://www.st-andrews.ac.uk/computer-science/people/lf28">Dr Lei Fang</a> (now my colleague at St Andrews): sensor correlation,
error detection, and inference, using statistical methods</li>
<li>
<a href="https://www.linkedin.com/in/graeme-stevenson-683463117/">Dr Graeme Stevenson</a>: programming with ontologically-structured
data</li>
<li>
<a href="https://www.wesleyan.edu/academics/faculty/sshai/profile.html">Dr Saray Shai</a> (now at Wesleyan University): coupled adaptive
complex networks</li>
<li>Dr Graham Williamson: Epidemic data dissemination in wireless
sensor networks</li>
<li>Dr Hui Zhang (now at Amazon): coverage problems in dense
homological and sparse mobile sensor networks</li>
<li>
<a href="https://susanmckeever.blogspot.com/">Dr Susan McKeever</a> (now at Technological University Dublin):
situation recognition using Dempster-Shafer evidence theory</li>
<li>Dr Emerson Loureiro: dynamic autonomic management of CPU shares</li>
<li>
<a href="http://www.comp.dit.ie/mcollins/">Dr Michael Collins</a> (now at Technological University Dublin):
secure wireless sensor network architectures</li>
<li>Dr Stephen Knox: situation recognition via case-based reasoning</li>
<li>
<a href="http://www.adrianclear.com/">Dr Adrian K. Clear</a> (now at NUI Galway): interactive definition
and visualisation of situations</li>
<li>
<a href="http://sites.google.com/site/juanyeresearch/">Dr Juan Ye</a> (now my colleague at the University of St Andrews):
situation recognition in pervasive and sensor-driven systems</li>
<li>
<a href="https://research.tees.ac.uk/en/persons/mohammad-abdur-razzaque">Dr M.A. Razzaque</a> (now at Teeside University): cross-layer
autonomic communications architectures</li>
<li>Dr Tim Walsh: lightweight mobile agents</li>
<li>
<a href="http://personal.cis.strath.ac.uk/%7Eterzis/">Dr Sotirios Terzis</a> (now at the University of Strathclyde):
pervasive trader architectures</li>
</ul>
</div>
</div>

<div id="outline-container-org0b9335d" class="outline-2">
<h2 id="org0b9335d">Postdocs</h2>
<div class="outline-text-2" id="text-org0b9335d">
<ul class="org-ul">
<li>
<a href="https://www.linkedin.com/in/davidecellai/">Dr Davide Cellai</a> (now at the Central Bank of Ireland): network
science</li>
<li>
<a href="http://lorcancoyle.org/">Dr Lorcan Coyle</a> (now at Intercomm): pervasive systems and machine
learning</li>
<li>
<a href="https://www.lancaster.ac.uk/scc/about-us/people/barry-porter">Prof Barry Porter</a> (now at Lancaster University): languages for
adaptive systems</li>
</ul>
</div>
</div>
	    </div>
	</article>
</div>

	<!-- Social sharing section -->

	<!-- Tag Section -->

	<!-- Post Navigation links -->

    <!-- Page Footer -->
    <section class="footer-sidebar clear" role="complementary"><div class="widget-block">
	    <aside class="widget"><h2 class="widget-title">Simon Dobson</h2>
		<div class="widget-text">Aut tace aut loquere meliora silentio</div>
	    </aside>
</div>
    </section><!-- Extra JavaScript --><!-- Site Attributions --><footer class="site-footer" role="contentinfo"><div class="site-info">
	    <p></p>
	    <p>
	      Built with free and open-source software.
	      Powered by <a href="https://getnikola.com/">Nikola</a> using a theme based on
	      <a href="https://note2self.abraham-v.com/libretto-theme-for-nikola/">Libretto</a>.
	    </p>
	    <p>
	      All content licensed under
	      <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/">CC-BY-NC-SA-4.0</a>
	      unless otherwise noted.
	    </p>
	</div>
	<div class="social">
	    <ul class="menu"></ul>
</div>
    </footer>
</body>
</html>
